package homeWork;
/**
 * 第五章，简答题
 * @author Administrator
 *
 */

public class day5_shoot_answer {
	public static void main(String[] args) {
		
	}
	/**
	 * 1. private、默认、protected、public四个权限修饰符的作用。
	 * 
	 * private:私有的，只能在自己类中调用
	 * 默认：只能在同一个包中调用
	 * protected：可以被同一个包中的类以及其他包中的子类调用
	 * public：公开的，可以被整个项目下的所有类调用
	 * 
	 */
	
	/**
	 * 2. 继承条件下子类构造方法的执行过程。
	 * 
	 * 
	 * 
	*/
	
	/**
	 * 3. 什么是向上转型和向下转型。
	 * 向上转型：父类引用指向子类对象，这个过程就是向上转型
	 * 向下转型：向上转型后的父类引用变量只能调用它编译类型的方法，不能调用它运行时类型的方法。
	 * 这时，我们需要进行类型的强制转换，这就是向下转型
	*/
	
	/**
	 * 4. final和abstract关键字的作用。
	 * final：修饰符用于修饰类、方法、变量，final修饰的类不能被继承，
	 *        修饰的方法不能被继承类重新定义，修饰的变量为常量，是不可修改的。
	 * abstract：修饰符，用来创建抽象类和抽象方法
	*/
	
	/**
	 * 5. ==和equals()的联系和区别。
	 * ==：代表双方是否相等。如果是基本类型则表示值是否相等，如果是引用类型则表示是同一个对象，地址相等。
	 * equals（）：比较对象内容是否相等
	 */

}
